# Análise Exploratória

In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv("education.csv")

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 907 entries, 0 to 906
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Country            907 non-null    object
 1   City               907 non-null    object
 2   University         907 non-null    object
 3   Program            907 non-null    object
 4   Level              907 non-null    object
 5   Duration_Years     907 non-null    float64
 6   Tuition_USD        907 non-null    int64
 7   Living_Cost_Index  907 non-null    float64
 8   Rent_USD           907 non-null    int64
 9   Visa_Fee_USD       907 non-null    int64
 10  Insurance_USD      907 non-null    int64
 11  Exchange_Rate      907 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 85.2+ KB

In [4]:
df.head(5)

,Country,City,University,Program,Level,Duration_Years,Tuition_USD,Living_Cost_Index,Rent_USD,Visa_Fee_USD,Insurance_USD,Exchange_Rate
0,USA,Cambridge,Harvard University,Computer Science,Master,2.0,55400,83.5,2200,160,1500,1.00
1,UK,London,Imperial College London,Data Science,Master,1.0,41200,75.8,1800,485,800,0.79
2,Canada,Toronto,University of Toronto,Business Analytics,Master,2.0,38500,72.5,1600,235,900,1.35
3,Australia,Melbourne,University of Melbourne,Engineering,Master,2.0,42000,71.2,1400,450,650,1.52
4,Germany,Munich,Technical University of Munich,Mechanical Engineering,Master,2.0,500,70.5,1100,75,550,0.92

In [23]:
for col in ["Country", "City", "Level"]:
    print(f"Contagem de {col}:")
    print(df[col].value_counts().head(5))
    print()

Contagem de Country:
Country
UK           93
Australia    86
USA          78
Canada       76
Germany      33
Name: count, dtype: int64

Contagem de City:
City
Singapore    18
Sydney       11
Melbourne    11
London       10
Canberra      8
Name: count, dtype: int64

Contagem de Level:
Level
Master      451
Bachelor    297
PhD         159
Name: count, dtype: int64

In [51]:
for col in ["University", "Program"]:
    print(f"Contagem de {col}:")
    print(df[col].value_counts().head(10))
    print()

Contagem de University:
University
University of Washington           6
Stanford University                5
Australian National University     5
University of Tasmania             5
University of Western Australia    5
University of Adelaide             5
Griffith University                5
University of Sydney               5
University of Melbourne            5
University of Wollongong           5
Name: count, dtype: int64

Contagem de Program:
Program
Computer Science           312
Data Science                82
Computer Engineering        71
Software Engineering        57
Artificial Intelligence     53
Data Analytics              50
Information Systems         40
Information Technology      24
Software Development        22
Data Engineering            19
Name: count, dtype: int64

In [39]:
new_df = df.groupby("Country")["Tuition_USD"].mean()
df_sorted = new_df.sort_values()
print(df_sorted.head(10))
print(df_sorted.tail(10))

Country
Argentina        0.000000
Finland          0.000000
Iceland          0.000000
Norway           0.000000
Sweden           0.000000
Greece         147.058824
Germany        177.272727
Luxembourg     400.000000
Brazil        1000.000000
Algeria       1100.000000
Name: Tuition_USD, dtype: float64
Country
Lebanon        14200.000000
Ireland        17890.000000
Hong Kong      22000.000000
UAE            24687.500000
New Zealand    29333.333333
Canada         29456.578947
UK             30341.935484
Singapore      34172.222222
Australia      34610.465116
USA            47742.307692
Name: Tuition_USD, dtype: float64

In [ ]:
levels_df = df[df["Level"] == "Bachelor"]

levels_df.groupby("Program")["Tuition_USD"].mean().sort_values(ascending=False)

Program
Aerospace Engineering        52300.000000
Industrial Engineering       43800.000000
Chemical Engineering         40900.000000
Computer Science & Design    31200.000000
Psychology                   31200.000000
Political Science            28900.000000
Computer Science             28137.333333
Computing Systems            27500.000000
Software Systems             25500.000000
Physics                      23500.000000
Mathematics                  22066.666667
Finance                      22000.000000
Economics                    21600.000000
Engineering                  20900.000000
Business                     20450.000000
Information Technology       16328.571429
Marine Biology               14250.000000
Data Analytics               13287.500000
Software Engineering         11926.470588
Medicine                      9800.000000
Computer Engineering          9795.384615
Information Systems           7865.625000
Information Science           7800.000000
Software Development          7571.428571
Data Science                  7319.166667
Mechatronics                  5800.000000
Computing                     5500.000000
Robotics                      5200.000000
Electronics Engineering       5200.000000
Artificial Intelligence       4683.333333
Design                        4200.000000
Digital Systems               3900.000000
Biomedical Sciences           3500.000000
Architecture                  3150.000000
Data Engineering              2400.000000
Social Sciences               1500.000000
Business Informatics          1440.000000
Computer Systems              1300.000000
Digital Innovation             890.000000
Mechanical Engineering         750.000000
Environmental Science            0.000000
Energy Engineering               0.000000
Digital Business                 0.000000
International Business           0.000000
Name: Tuition_USD, dtype: float64

## Convertendo para json

Mais fácil de trabalhar com json no javascript

In [54]:
import csv
import json

csv_file = 'education.csv'
json_file = '../static/education.json'

data = []

with open(csv_file, encoding='utf-8') as f:
    reader = csv.DictReader(f)
    for row in reader:
        data.append(row)

with open(json_file, 'w', encoding='utf-8') as f:
    json.dump(data, f, ensure_ascii=False, indent=2)

print(f'Converted {csv_file} to {json_file} with {len(data)} records.')

Converted education.csv to ../static/education.json with 907 records.